Repository: EL-BID/MapaInversiones
Catalog: MapaInversiones.Web/Localization/*/OrchardCore.Localization.Core.po
Languages: fr

# OrchardCore.Localization.Core.DataAnnotations
source: The {0***REMOVED*** field is required.
fr: Le champ {0***REMOVED*** est requis.

source: The associated metadata type for type '{0***REMOVED***' contains the following unknown properties or fields: {1***REMOVED***. Please make sure that the names of these members match the names of the properties on the main type.
fr: Le type de métadonnées associé pour le type '{0***REMOVED***' contient les propriétés ou champs inconnus suivants : {1***REMOVED***. Veuillez vous assurer que les noms de ces membres correspondent aux noms des propriétés du type principal.

source: The type '{0***REMOVED***' does not contain a public property named '{1***REMOVED***'.
fr: Le type '{0***REMOVED***' ne contient pas de propriété publique nommée '{1***REMOVED***'.

source: The property {0***REMOVED***.{1***REMOVED*** could not be found.
fr: La propriété {0***REMOVED***.{1***REMOVED*** est introuvable.

source: '{0***REMOVED***' and '{1***REMOVED***' do not match.
fr: '{0***REMOVED***' et '{1***REMOVED***' ne correspondent pas.

source: Could not find a property named {0***REMOVED***.
fr: Impossible de trouver une propriété nommée {0***REMOVED***.

source: The {0***REMOVED*** field is not a valid credit card number.
fr: Le champ {0***REMOVED*** n'est pas un numéro de carte de crédit valide.

source: The CustomValidationAttribute method '{0***REMOVED***' in type '{1***REMOVED***' must return System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success to represent success.
fr: La méthode CustomValidationAttribute '{0***REMOVED***' dans le type '{1***REMOVED***' doit renvoyer System.ComponentModel.DataAnnotations.ValidationResult. Utilisez System.ComponentModel.DataAnnotations.ValidationResult.Success pour représenter le succès.

source: The CustomValidationAttribute method '{0***REMOVED***' does not exist in type '{1***REMOVED***' or is not public and static.
fr: La méthode CustomValidationAttribute '{0***REMOVED***' n'existe pas dans le type '{1***REMOVED***' ou n'est pas publique et statique.

source: The CustomValidationAttribute.Method was not specified.
fr: La méthode CustomValidationAttribute n'a pas été spécifiée.

source: The CustomValidationAttribute method '{0***REMOVED***' in type '{1***REMOVED***' must match the expected signature: public static ValidationResult {0***REMOVED***(object value, ValidationContext context). The value can be strongly typed. The ValidationContext parameter is optional.
fr: La méthode CustomValidationAttribute '{0***REMOVED***' dans le type '{1***REMOVED***' doit correspondre à la signature attendue : public static ValidationResult {0***REMOVED***(object value, ValidationContext context). La valeur peut être fortement typée. Le paramètre ValidationContext est facultatif.

source: Could not convert the value of type '{0***REMOVED***' to '{1***REMOVED***' as expected by method {2***REMOVED***.{3***REMOVED***.
fr: Impossible de convertir la valeur du type '{0***REMOVED***' en '{1***REMOVED***' comme attendu par la méthode {2***REMOVED***.{3***REMOVED***.

source: The custom validation type '{0***REMOVED***' must be public.
fr: Le type de validation personnalisée '{0***REMOVED***' doit être public.

source: {0***REMOVED*** is not valid.
fr: {0***REMOVED*** n'est pas valide.

source: The CustomValidationAttribute.ValidatorType was not specified.
fr: Le CustomValidationAttribute.ValidatorType n'a pas été spécifié.

source: The custom DataType string cannot be null or empty.
fr: La chaîne de caractères DataType personnalisée ne peut pas être vide ou nulle.

source: The {0***REMOVED*** property has not been set. Use the {1***REMOVED*** method to get the value.
fr: La propriété {0***REMOVED*** n'a pas été définie. Utilisez la méthode {1***REMOVED*** pour obtenir la valeur.

source: The {0***REMOVED*** field is not a valid e-mail address.
fr: Le champ {0***REMOVED*** n'est pas une adresse e-mail valide.

source: The type provided for EnumDataTypeAttribute cannot be null.
fr: Le type fourni pour EnumDataTypeAttribute ne peut pas être null.

source: The type '{0***REMOVED***' needs to represent an enumeration type.
fr: Le type '{0***REMOVED***' doit représenter un type d'énumération.

source: The {0***REMOVED*** field only accepts files with the following extensions: {1***REMOVED***.
fr: Le champ {0***REMOVED*** accepte uniquement les fichiers avec les extensions suivantes : {1***REMOVED***.

source: Cannot retrieve property '{0***REMOVED***' because localization failed. Type '{1***REMOVED***' is not public or does not contain a public static string property with the name '{2***REMOVED***'.
fr: Impossible de récupérer la propriété '{0***REMOVED***' car la localisation a échoué. Le type '{1***REMOVED***' n'est pas public ou ne contient pas de propriété de chaîne statique publique avec le nom '{2***REMOVED***'.

source: MaxLengthAttribute must have a Length value that is greater than zero. Use MaxLength() without parameters to indicate that the string or array can have the maximum allowable length.
fr: MaxLengthAttribute doit avoir une valeur de longueur supérieure à zéro. Utilisez la fonction MaxLength() sans paramètre pour indiquer que la chaîne ou le tableau peut avoir la longueur maximale autorisée.

source: The field {0***REMOVED*** must be a string or array type with a maximum length of '{1***REMOVED***'.
fr: Le champ {0***REMOVED*** doit être un type de chaîne ou de tableau d'une longueur maximale de '{1***REMOVED***'.

source: MetadataClassType cannot be null.
fr: MetadataClassType ne peut pas être null.

source: MinLengthAttribute must have a Length value that is zero or greater.
fr: MinLengthAttribute doit avoir une valeur de longueur égale ou supérieure à zéro.

source: The field {0***REMOVED*** must be a string or array type with a minimum length of '{1***REMOVED***'.
fr: Le champ {0***REMOVED*** doit être un type de chaîne ou de tableau d'une longueur minimale de '{1***REMOVED***'.

source: The field of type {0***REMOVED*** must be a string, array or ICollection type.
fr: Le champ de type {0***REMOVED*** doit être une chaîne, un tableau ou un type ICollection.

source: The {0***REMOVED*** field is not a valid phone number.
fr: Le champ {0***REMOVED*** n'est pas un numéro de téléphone valide.

source: The type {0***REMOVED*** must implement {1***REMOVED***.
fr: Le type {0***REMOVED*** doit implémenter {1***REMOVED***.

source: The maximum value '{0***REMOVED***' must be greater than or equal to the minimum value '{1***REMOVED***'.
fr: La valeur maximale '{0***REMOVED***' doit être supérieure ou égale à la valeur minimale '{1***REMOVED***'.

source: The minimum and maximum values must be set.
fr: Les valeurs minimales et maximales doivent être définies.

source: The OperandType must be set when strings are used for minimum and maximum values.
fr: L'OperandType doit être défini lorsque des chaînes de caractères sont utilisées pour des valeurs minimales et maximales.

source: The field {0***REMOVED*** must be between {1***REMOVED*** and {2***REMOVED***.
fr: Le champ {0***REMOVED*** doit être compris entre {1***REMOVED*** et {2***REMOVED***.

source: The field {0***REMOVED*** must match the regular expression '{1***REMOVED***'.
fr: Le champ {0***REMOVED*** doit correspondre à l'expression régulière '{1***REMOVED***'.

source: The pattern must be set to a valid regular expression.
fr: Le modèle doit être une expression régulière valide.

source: The {0***REMOVED*** field is required.
fr: Le champ {0***REMOVED*** est requis.

source: The maximum length must be a nonnegative integer.
fr: La longueur maximale doit être un entier non négatif.

source: The field {0***REMOVED*** must be a string with a maximum length of {1***REMOVED***.
fr: Le champ {0***REMOVED*** doit être une chaîne de caractères d'une longueur maximale de {1***REMOVED***.

source: The field {0***REMOVED*** must be a string with a minimum length of {2***REMOVED*** and a maximum length of {1***REMOVED***.
fr: Le champ {0***REMOVED*** doit être une chaîne de caractères d'une longueur minimale de {2***REMOVED*** et d'une longueur maximale de {1***REMOVED***.

source: The key parameter at position {0***REMOVED*** with value '{1***REMOVED***' is not a string. Every key control parameter must be a string.
fr: Le paramètre clé à la position {0***REMOVED*** avec la valeur '{1***REMOVED***' n'est pas une chaîne. Chaque paramètre de contrôle de clé doit être une chaîne.

source: The key parameter at position {0***REMOVED*** is null. Every key control parameter must be a string.
fr: Le paramètre clé à la position {0***REMOVED*** est null. Chaque paramètre de contrôle de clé doit être une chaîne de caractères.

source: The key parameter at position {0***REMOVED*** with value '{1***REMOVED***' occurs more than once.
fr: Le paramètre clé à la position {0***REMOVED*** avec la valeur '{1***REMOVED***' se produit plus d'une fois.

source: The number of control parameters must be even.
fr: Le nombre de paramètres de contrôle doit être pair.

source: The {0***REMOVED*** field is not a valid fully-qualified http, https, or ftp URL.
fr: Le champ {0***REMOVED*** n'est pas une URL http, https, ou ftp entièrement qualifiée.

source: Either ErrorMessageString or ErrorMessageResourceName must be set, but not both.
fr: ErreurMessageString ou ErrorMessageResourceName doivent être définis, mais pas les deux.

source: IsValid(object value) has not been implemented by this class. The preferred entry point is GetValidationResult() and classes should override IsValid(object value, ValidationContext context).
fr: IsValid(valeur de l'objet) n'a pas été implémenté par cette classe. Le point d'entrée préféré est GetValidationResult() et les classes doivent remplacer IsValid(valeur de l'objet, contexte de ValidationContexte).

source: Both ErrorMessageResourceType and ErrorMessageResourceName need to be set on this attribute.
fr: Les deux types ErrorMessageResourceType et ErrorMessageResourceName doivent être définis sur cet attribut.

source: The property '{0***REMOVED***' on resource type '{1***REMOVED***' is not a string type.
fr: La propriété '{0***REMOVED***' sur le type de ressource '{1***REMOVED***' n'est pas de type chaîne de caractères.

source: The resource type '{0***REMOVED***' does not have an accessible static property named '{1***REMOVED***'.
fr: Le type de ressource '{0***REMOVED***' n'a pas de propriété statique accessible nommée '{1***REMOVED***'.

source: The field {0***REMOVED*** is invalid.
fr: Le champ {0***REMOVED*** est invalide.

source: The instance provided must match the ObjectInstance on the ValidationContext supplied.
fr: L'instance fournie doit correspondre à ObjectInstance sur le ValidationContext fourni.

source: The value for property '{0***REMOVED***' must be of type '{1***REMOVED***'.
fr: La valeur de la propriété '{0***REMOVED***' doit être de type '{1***REMOVED***'.
