Repository: EL-BID/MapaInversiones
Catalog: MapaInversiones.Web/Localization/*/OrchardCore.DisplayManagement.po
Languages: vi, zh_cn

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: 1 year ago
vi: {0***REMOVED*** năm trước
zh_cn: {0***REMOVED*** 年前

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: in 1 year
vi: trong {0***REMOVED*** năm
zh_cn: {0***REMOVED*** 年内

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: 1 month ago
vi: {0***REMOVED*** tháng trước
zh_cn: {0***REMOVED*** 个月前

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: in 1 month
vi: trong {0***REMOVED*** tháng
zh_cn: {0***REMOVED*** 个月内

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: 1 week ago
vi: {0***REMOVED*** tuần trước
zh_cn: {0***REMOVED*** 周前

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: in 1 week
vi: trong {0***REMOVED*** tuần
zh_cn: {0***REMOVED*** 周内

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: 1 day ago
vi: {0***REMOVED*** ngày trước
zh_cn: {0***REMOVED*** 天前

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: in 1 day
vi: trong {0***REMOVED*** ngày
zh_cn: {0***REMOVED*** 天内

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: 1 hour ago
vi: {0***REMOVED*** giờ trước
zh_cn: {0***REMOVED*** 小时前

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: in 1 hour
vi: trong {0***REMOVED*** giờ
zh_cn: {0***REMOVED*** 小时内

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: 1 minute ago
vi: {0***REMOVED*** phút trước
zh_cn: {0***REMOVED*** 分钟前

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: in 1 minute
vi: trong {0***REMOVED*** phút
zh_cn: 在 {0***REMOVED*** 分钟内

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: 1 second ago
vi: {0***REMOVED*** giây trước
zh_cn: {0***REMOVED*** 秒前

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: in 1 second
vi: trong {0***REMOVED*** giây
zh_cn: 在 {0***REMOVED*** 秒内

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: a moment ago
vi: vừa đây
zh_cn: 刚才

# OrchardCore.DisplayManagement.Shapes.DateTimeShapes
source: in a moment
vi: vừa xong
zh_cn: 在某一时刻
