Repository: EL-BID/MapaInversiones
Catalog: MapaInversiones.Web/Localization/*/OrchardCore.Infrastructure.po
Languages: ar, fa

# OrchardCore.Environment.Commands.CommandHostAgent
source: Error executing command "{0***REMOVED***"
ar: خطأ في تنفيذ الأمر "{0***REMOVED***"
fa: خطا هنگام اجرای فرمان "{0***REMOVED***"

# OrchardCore.Environment.Commands.CommandHostAgent
source: Exception Details: {0***REMOVED***: {1***REMOVED***
ar: تفاصيل الإستثناء: {0***REMOVED***: {1***REMOVED***
fa: جزئیات خطا: {0***REMOVED***: {1***REMOVED***

# OrchardCore.Environment.Commands.CommandHostAgent
source: Stack Trace:
ar: حزمة التتبع:
fa: ردیابی پشته:

# OrchardCore.Environment.Commands.CommandHostAgent
source: Tenant {0***REMOVED*** does not exist
ar: الـ Tenant {0***REMOVED*** غير موجود
fa: تِنِنت (tenant) به عنوان {0***REMOVED*** وجود ندارد

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Switch "{0***REMOVED***" was not found
ar: رمز التبديل "{0***REMOVED***" غير موجود
fa: سوئیچ "{0***REMOVED***" یافت نشد

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: A property "{0***REMOVED***" exists but is not decorated with "{1***REMOVED***"
ar: الخاصية "{0***REMOVED***" موجوده ولكن ليست مزينة بـ "{1***REMOVED***"
fa: Property (ویژگی) "{0***REMOVED***" وجود دارد اما با "{1***REMOVED***" decorate نشده است

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Error converting value "{0***REMOVED***" to "{1***REMOVED***" for switch "{2***REMOVED***"
ar: خطأ أثناء تحويل القيمة "{0***REMOVED***" إلى "{1***REMOVED***" لرمز التبديل '{2***REMOVED***'
fa: خطا هنگام تبدیل مقدار "{0***REMOVED***" به "{1***REMOVED***" برای سوییچ "{2***REMOVED***"

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Command arguments "{0***REMOVED***" don't match command definition
ar: وسيطات الأمر "{0***REMOVED***" لا يطابق تعريف الأمر
fa: آرگومان‌های دستور "{0***REMOVED***" با تعریف دستور مطابقت ندارند

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Method "{0***REMOVED***" does not support switch "{1***REMOVED***".
ar: الإجراء "{0***REMOVED***" غير مدعوم لرمز التبديل "{1***REMOVED***".
fa: متود "{0***REMOVED***" از سوییچ "{1***REMOVED***" پشتیبانی نمی‌کند.

# OrchardCore.Environment.Commands.DefaultCommandManager
source: Multiple commands found matching arguments "{0***REMOVED***". Commands available: {1***REMOVED***.
ar: توجد عة أوامر تطابق المتغييرات {0***REMOVED***. الأوامر المتاحة: {1***REMOVED***.
fa: چندین دستور که با آرگومان‌های "{0***REMOVED***" مطابقت دارند، پیدا شد. دستورهای موجود: {1***REMOVED***.

# OrchardCore.Environment.Commands.DefaultCommandManager
source: No command found matching arguments "{0***REMOVED***". Commands available: {1***REMOVED***.
ar: لا يوجد أمر يطابق المتغييرات {0***REMOVED***. الأوامر المتاحة: {1***REMOVED***.
fa: هیچ دستوری که با آرگومان‌های "{0***REMOVED***" مطابقت داشته باشد، پیدا نشد. فرمان‌های موجود: {1***REMOVED***.

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: List of available commands:
ar: قائمة بالأوامر المتاحة:
fa: لیست دستورات موجود:

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: Command {0***REMOVED*** doesn't exist
ar: الأمر {0***REMOVED*** غير موجود
fa: دستور {0***REMOVED*** وجود ندارد

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: {0***REMOVED***.{1***REMOVED***: no help text
ar: {0***REMOVED***.{1***REMOVED***: لا يوجد نص مساعده
fa: {0***REMOVED***.{1***REMOVED***: متن راهنما وجود ندارد
