Repository: EL-BID/MapaInversiones
Catalog: PlataformaTransparencia.Web/Localization/*/OrchardCore.Infrastructure.po
Languages: fr, it

# OrchardCore.Environment.Commands.CommandHostAgent
source: Error executing command "{0***REMOVED***"
fr: Erreur en exécutant la commande "{0***REMOVED***"
it: Errore nell'esecuzione del comando "{0***REMOVED***"

# OrchardCore.Environment.Commands.CommandHostAgent
source: Exception Details: {0***REMOVED***: {1***REMOVED***
fr: Détails d'exception : {0***REMOVED***: {1***REMOVED***
it: Dettagli dell'eccezione: {0***REMOVED*** - {1***REMOVED***

# OrchardCore.Environment.Commands.CommandHostAgent
source: Stack Trace:
fr: État de la pile :

# OrchardCore.Environment.Commands.CommandHostAgent
source: Tenant {0***REMOVED*** does not exist
fr: Le locataire {0***REMOVED*** n'existe pas
it: Il tenant {0***REMOVED*** non esiste

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Switch "{0***REMOVED***" was not found
fr: Le switch "{0***REMOVED***" n'a pas été trouvé
it: Comando "{0***REMOVED***" non trovato

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: A property "{0***REMOVED***" exists but is not decorated with "{1***REMOVED***"
fr: Une propriété "{0***REMOVED***" existe mais n'a pas été décorée avec "{1***REMOVED***"
it: Una proprietà "{0***REMOVED***" esiste ma non è decorata con "{1***REMOVED***"

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Error converting value "{0***REMOVED***" to "{1***REMOVED***" for switch "{2***REMOVED***"
fr: Erreur lors de la conversion de la valeur "{0***REMOVED***" à "{1***REMOVED***" pour le switch "{2***REMOVED***"
it: Errore nella conversione del valore "{0***REMOVED***" in "{1***REMOVED***" per il comando "{2***REMOVED***"

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Command arguments "{0***REMOVED***" don't match command definition
fr: Les arguments de commande "{0***REMOVED***" ne correspondent pas à la définition de la commande
it: Argomenti del comando "{0***REMOVED***" non corrispondono alla definizione del comando

# OrchardCore.Environment.Commands.DefaultCommandHandler
source: Method "{0***REMOVED***" does not support switch "{1***REMOVED***".
fr: La méthode "{0***REMOVED***" ne prend pas en charge le switch "{1***REMOVED***".
it: Il metodo "{0***REMOVED***" non supportato dal comando "{1***REMOVED***".

# OrchardCore.Environment.Commands.DefaultCommandManager
source: Multiple commands found matching arguments "{0***REMOVED***". Commands available: {1***REMOVED***.
fr: Plusieurs commandes trouvées correspondants aux arguments "{0***REMOVED***". Commandes disponibles : {1***REMOVED***.
it: Sono stati trovati più comandi che corrispondono agli argomenti "{0***REMOVED***". Comandi disponibili: {1***REMOVED***.

# OrchardCore.Environment.Commands.DefaultCommandManager
source: No command found matching arguments "{0***REMOVED***". Commands available: {1***REMOVED***.
fr: Aucune commande trouvée correspondant aux arguments"{0***REMOVED***". Commandes disponibles : {1***REMOVED***.
it: Nessun comando trovato con gli argomenti "{0***REMOVED***". Comandi disponibili: {1***REMOVED***.

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: List of available commands:
fr: Liste des commandes disponibles :
it: Elenco dei comandi disponibili:

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: Command {0***REMOVED*** doesn't exist
fr: La commande {0***REMOVED*** n'existe pas
it: Il comando {0***REMOVED*** non esiste

# OrchardCore.Environment.Commands.Builtin.HelpCommand
source: {0***REMOVED***.{1***REMOVED***: no help text
fr: {0***REMOVED***.{1***REMOVED***: aucun texte d'aide
it: {0***REMOVED***.{1***REMOVED***: nessun testo di aiuto
