Repository: EL-BID/MapaInversiones
Catalog: PlataformaTransparencia.Web/Localization/*/OrchardCore.Localization.Core.po
Languages: it

# OrchardCore.Localization.Core.DataAnnotations
source: The {0***REMOVED*** field is required.
it: Il campo {0***REMOVED*** è obbligatorio.

source: The associated metadata type for type '{0***REMOVED***' contains the following unknown properties or fields: {1***REMOVED***. Please make sure that the names of these members match the names of the properties on the main type.
it: Il tipo di metadati associato per il tipo «{0***REMOVED***» contiene le seguenti proprietà o campi sconosciuti: {1***REMOVED***. Assicurarsi che i nomi di questi membri corrispondano ai nomi delle proprietà sul tipo principale.

source: The type '{0***REMOVED***' does not contain a public property named '{1***REMOVED***'.
it: Il tipo '{0***REMOVED***' non contiene una proprietà pubblica chiamata '{1***REMOVED***'.

source: The property {0***REMOVED***.{1***REMOVED*** could not be found.
it: La proprietà {0***REMOVED***.{1***REMOVED*** non è stata trovata.

source: '{0***REMOVED***' and '{1***REMOVED***' do not match.
it: '{0***REMOVED***' e '{1***REMOVED***' non corrispondono.

source: Could not find a property named {0***REMOVED***.
it: Impossibile trovare una proprietà denominata {0***REMOVED***.

source: The {0***REMOVED*** field is not a valid credit card number.
it: Il campo {0***REMOVED*** non è un numero di carta di credito valido.

source: The CustomValidationAttribute method '{0***REMOVED***' in type '{1***REMOVED***' must return System.ComponentModel.DataAnnotations.ValidationResult. Use System.ComponentModel.DataAnnotations.ValidationResult.Success to represent success.
it: Il metodo CustomValidationAttribute '{0***REMOVED***' nel tipo '{1***REMOVED***' deve restituire System.ComponentModel.DataAnnotations.ValidationResult. Utilizzare System.ComponentModel.DataAnnotations.ValidationResult.Success per indicare un operazione completata con successo.

source: The CustomValidationAttribute method '{0***REMOVED***' does not exist in type '{1***REMOVED***' or is not public and static.
it: Il metodo CustomValidationAttribute '{0***REMOVED***' non esiste nel tipo '{1***REMOVED***' o non è pubblico e statico.

source: The CustomValidationAttribute.Method was not specified.
it: Il metodo CustomValidationAttribute.Method non è stato specificato.

source: The CustomValidationAttribute method '{0***REMOVED***' in type '{1***REMOVED***' must match the expected signature: public static ValidationResult {0***REMOVED***(object value, ValidationContext context). The value can be strongly typed. The ValidationContext parameter is optional.
it: Il metodo CustomValidationAttribute '{0***REMOVED***' nel tipo '{1***REMOVED***' deve corrispondere alla definizione: public static ValidationResult {0***REMOVED***(object value, ValidationContext context). L'argomento value può essere tipicizzato. Il parametro ValidationContext è opzionale.

source: Could not convert the value of type '{0***REMOVED***' to '{1***REMOVED***' as expected by method {2***REMOVED***.{3***REMOVED***.
it: Impossibile convertire il valore di tipo '{0***REMOVED***' in '{1***REMOVED***' come previsto dal metodo {2***REMOVED***.{3***REMOVED***.

source: The custom validation type '{0***REMOVED***' must be public.
it: Il tipo di validazione personalizzato '{0***REMOVED***' deve essere pubblico.

source: {0***REMOVED*** is not valid.
it: {0***REMOVED*** non è valido.

source: The CustomValidationAttribute.ValidatorType was not specified.
it: Il CustomValidationAttribute.ValidatorType non è stato specificato.

source: The custom DataType string cannot be null or empty.
it: La stringa DataType personalizzata non può essere nulla o vuota.

source: The {0***REMOVED*** property has not been set. Use the {1***REMOVED*** method to get the value.
it: La proprietà {0***REMOVED*** non è stata impostata. Usa il metodo {1***REMOVED*** per ottenere il valore.

source: The {0***REMOVED*** field is not a valid e-mail address.
it: Il campo {0***REMOVED*** non è un indirizzo e-mail valido.

source: The type provided for EnumDataTypeAttribute cannot be null.
it: Il tipo fornito per EnumDataTypeAttribute non può essere nullo.

source: The type '{0***REMOVED***' needs to represent an enumeration type.
it: Il tipo '{0***REMOVED***' deve rappresentare un tipo enumerator.

source: The {0***REMOVED*** field only accepts files with the following extensions: {1***REMOVED***.
it: Il campo {0***REMOVED*** accetta solo file con le seguenti estensioni: {1***REMOVED***.

source: Cannot retrieve property '{0***REMOVED***' because localization failed. Type '{1***REMOVED***' is not public or does not contain a public static string property with the name '{2***REMOVED***'.
it: Impossibile recuperare la proprietà '{0***REMOVED***' perché la localizzazione non è riuscita. Il tipo «{1***REMOVED***» non è pubblico o non contiene una proprietà di stringa statica pubblica con il nome «{2***REMOVED***».

source: MaxLengthAttribute must have a Length value that is greater than zero. Use MaxLength() without parameters to indicate that the string or array can have the maximum allowable length.
it: MaxLengthAttribute deve avere un valore di lunghezza maggiore di zero. Usa MaxLength() senza parametri per indicare che la stringa o l'array può avere una lunghezza massima consentita.

source: The field {0***REMOVED*** must be a string or array type with a maximum length of '{1***REMOVED***'.
it: Il campo {0***REMOVED*** deve essere una stringa o un tipo di array con una lunghezza massima di '{1***REMOVED***'.

source: MetadataClassType cannot be null.
it: MetadataClassType non può essere nullo.

source: MinLengthAttribute must have a Length value that is zero or greater.
it: MinLengthAttribute deve avere un valore di lunghezza pari o superiore a zero.

source: The field {0***REMOVED*** must be a string or array type with a minimum length of '{1***REMOVED***'.
it: Il campo {0***REMOVED*** deve essere una stringa o un tipo di array con una lunghezza minima di '{1***REMOVED***'.

source: The field of type {0***REMOVED*** must be a string, array or ICollection type.
it: Il campo di tipo {0***REMOVED*** deve essere un tipo di stringa, array o ICollection.

source: The {0***REMOVED*** field is not a valid phone number.
it: Il campo {0***REMOVED*** non è un numero di telefono valido.

source: The type {0***REMOVED*** must implement {1***REMOVED***.
it: Il tipo {0***REMOVED*** deve implementare {1***REMOVED***.

source: The maximum value '{0***REMOVED***' must be greater than or equal to the minimum value '{1***REMOVED***'.
it: Il valore massimo '{0***REMOVED***' deve essere maggiore o uguale al valore minimo '{1***REMOVED***'.

source: The minimum and maximum values must be set.
it: Devono essere fissati i valori minimi e massimi.

source: The OperandType must be set when strings are used for minimum and maximum values.
it: Il OperandType deve essere impostato quando le stringhe sono utilizzate per valori minimi e massimi.

source: The field {0***REMOVED*** must be between {1***REMOVED*** and {2***REMOVED***.
it: Il campo "{0***REMOVED***" deve essere compreso fra {1***REMOVED*** e {2***REMOVED***.

source: The field {0***REMOVED*** must match the regular expression '{1***REMOVED***'.
it: Il campo {0***REMOVED*** deve corrispondere all'espressione regolare '{1***REMOVED***'.

source: The pattern must be set to a valid regular expression.
it: Il modello deve essere impostato con un'espressione regolare valida.

source: The {0***REMOVED*** field is required.
it: Il campo {0***REMOVED*** è obbligatorio.

source: The maximum length must be a nonnegative integer.
it: La lunghezza massima deve essere un numero intero non negativo.

source: The field {0***REMOVED*** must be a string with a maximum length of {1***REMOVED***.
it: Il campo {0***REMOVED*** deve essere una stringa con una lunghezza massima di '{1***REMOVED***.

source: The field {0***REMOVED*** must be a string with a minimum length of {2***REMOVED*** and a maximum length of {1***REMOVED***.
it: Il campo {0***REMOVED*** deve essere una stringa con una lunghezza minima di {2***REMOVED*** e una lunghezza massima di {1***REMOVED***.

source: The key parameter at position {0***REMOVED*** with value '{1***REMOVED***' is not a string. Every key control parameter must be a string.
it: Il parametro chiave {0***REMOVED*** valorizzato con '{1***REMOVED***' non è una stringa. Ogni parametro di controllo chiave deve essere una stringa.

source: The key parameter at position {0***REMOVED*** is null. Every key control parameter must be a string.
it: Il parametro chiave {0***REMOVED*** valorizzato è nullo. Ogni parametro di controllo chiave deve essere una stringa.

source: The key parameter at position {0***REMOVED*** with value '{1***REMOVED***' occurs more than once.
it: Il parametro chiave alla posizione {0***REMOVED*** con valore '{1***REMOVED***' è presente più di una volta.

source: The number of control parameters must be even.
it: Il numero di parametri di controllo deve essere pari.

source: The {0***REMOVED*** field is not a valid fully-qualified http, https, or ftp URL.
it: Il campo {0***REMOVED*** non è un URL http, https o ftp fully-qualified valido.

source: Either ErrorMessageString or ErrorMessageResourceName must be set, but not both.
it: O ErrorMessageString o ErrorMessageResourceName deve essere impostato, ma non entrambi.

source: IsValid(object value) has not been implemented by this class. The preferred entry point is GetValidationResult() and classes should override IsValid(object value, ValidationContext context).
it: IsValid(object value) non è stato implementato da questa classe. L'entry point GetValidationResult() e le classi, dovrebbero sovrascrivere IsValid(object value, ValidationContext context).

source: Both ErrorMessageResourceType and ErrorMessageResourceName need to be set on this attribute.
it: Entrambi ErrorMessageResourceType e ErrorMessageResourceName devono essere impostati su questo attributo.

source: The property '{0***REMOVED***' on resource type '{1***REMOVED***' is not a string type.
it: La proprietà '{0***REMOVED***' sul tipo di risorsa '{1***REMOVED***' non è un tipo di stringa.

source: The resource type '{0***REMOVED***' does not have an accessible static property named '{1***REMOVED***'.
it: Il tipo di risorsa '{0***REMOVED***' non ha una proprietà statica accessibile chiamata '{1***REMOVED***'.

source: The field {0***REMOVED*** is invalid.
it: Il campo '{0***REMOVED***' non è valido.

source: The instance provided must match the ObjectInstance on the ValidationContext supplied.
it: L'istanza fornita deve corrispondere all' ObjectInstance nel ValidationContext fornito.

source: The value for property '{0***REMOVED***' must be of type '{1***REMOVED***'.
it: Il valore per la proprietà '{0***REMOVED***' deve essere di tipo '{1***REMOVED***'.
